Repository: WanXcodinG/tr
Catalog: xtr/lang/*/LC_MESSAGES/xtr.po
Languages: fr

source: Extract strings from a rust crate to be translated with gettext
fr: Extrait les chaine de charactère depuis a crate rust, pour être traduit avec gettext

source: Use name.po for output (instead of messages.po)
fr: Utilise name.po pour le fichier de sortie (à la place de messages.po)

source: Write output to specified file (instead of messages.po).
fr: Écrit la sortie dans le fichier spécifier (à la place de messages.po).

source: Specify keywordspec as an additional keyword to be looked for. Refer to the xgettext documentation for more info.
fr: Specifie keywordspec comme mot clé additional. La documentation de xgettext contiens plus d'information

source: Don’t write header with ‘msgid ""’ entry
fr: N'écris pas l'en-tête avec « msgid "" »

source: Set the copyright holder in the output.
fr: Spécifie le détenneur du copyright dans la sortie

source: Set the package name in the header of the output.
fr: Spécifie le nom du packet

source: Set the package version in the header of the output.
fr: donne la version du packet

source: Set the reporting address for msgid bugs. This is the email address or URL to which the translators shall report bugs in the untranslated strings
fr: donne l'addresse pour reporter les bugs dans les texte. C'est une addresse email ou une URL que les traducteurs peuvent utiliser pour rapporter des bugs dans les chaine non traduite

source: The encoding used for the characters in the POT file's locale.
fr: L'encodage utilisé pour les caractères dans le fichier POT.

source: How much message location information to include in the output. (default). If the type is ‘full’ (the default), it generates the lines with both file name and line number: ‘#: filename:line’. If it is ‘file’, the line number part is omitted: ‘#: filename’. If it is ‘never’, nothing is generated.
fr: Quelle quantité d'informations sur l'emplacement du message à inclure dans la sortie. Avec "full" (par défaut), génère les lignes avec le nom du ficher et le numéro de ligne : ‘#: fichier:ligne’. Avec "file", le numéro de ligne est omis : ‘#: fichier. Si c'est "never", rien n'est généré.

source: Main rust files to parse (will recurse into modules)
fr: Fichers rust principaux à parser (va analyser les module récursivement)
